; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v11 ?v1)
             (pred_1 ?v6 ?v10)
             (pred_10 ?v11 ?v10)
             (pred_12 ?v7 ?v11 )
	     (pred_11 ?v11)
             (pred_8 ?v12)
             (pred_9 ?v6)
             (pred_2 ?v10)
             (pred_3 ?v11)
             (pred_5 ?v6)
             (pred_6 ?v11)
             (pred_4 ))



(:action op_1
:parameters (?v5 ?v9 ?v3 ?v2)
:precondition (and (pred_8 ?v5) (pred_8 ?v9) (pred_9 ?v3) (pred_2 ?v2)
          (pred_7 ?v5 ?v9) (pred_1 ?v3 ?v2)
                   (pred_10 ?v9 ?v2) (pred_11 ?v5) 
                   (pred_3 ?v9) (pred_5 ?v3))
:effect (and  (pred_6 ?v9) (not (pred_3 ?v9))))


(:action op_2
:parameters (?v5 ?v13)
:precondition (and (pred_8 ?v5) (pred_8 ?v13)
               (pred_11 ?v5) (pred_7 ?v5 ?v13) (pred_6 ?v13))
:effect (and (pred_11 ?v13) (not (pred_11 ?v5))))

(:action op_4
:parameters (?v5 ?v3)
:precondition (and (pred_8 ?v5) (pred_9 ?v3) 
                  (pred_11 ?v5) (pred_12 ?v3 ?v5) (pred_4 ))
:effect (and (pred_5 ?v3)
   (not (pred_12 ?v3 ?v5)) (not (pred_4 ))))


(:action op_5
:parameters (?v5 ?v8 ?v4)
:precondition (and (pred_8 ?v5) (pred_9 ?v8) (pred_9 ?v4)
                  (pred_11 ?v5) (pred_5 ?v4) (pred_12 ?v8 ?v5))
:effect (and (pred_5 ?v8) (pred_12 ?v4 ?v5)
        (not (pred_5 ?v4)) (not (pred_12 ?v8 ?v5))))

(:action op_3
:parameters (?v5 ?v3)
:precondition (and (pred_8 ?v5) (pred_9 ?v3) 
                  (pred_11 ?v5) (pred_5 ?v3))
:effect (and (pred_4 ) (pred_12 ?v3 ?v5) (not (pred_5 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_18 obj_12 obj_19 obj_10 obj_16 obj_05 obj_06 obj_11 obj_01 obj_21 obj_09 obj_08 obj_04 obj_14 obj_15
    obj_13 obj_20
    obj_07 obj_03 obj_17
    )

    (:init
       (pred_4)

       (pred_8 obj_02)
       (pred_8 obj_18)
       (pred_8 obj_12)
       (pred_8 obj_19)
       (pred_8 obj_10)
       (pred_8 obj_16)
       (pred_8 obj_05)
       (pred_8 obj_06)
       (pred_8 obj_11)
       (pred_8 obj_01)
       (pred_8 obj_21)
       (pred_8 obj_09)
       (pred_8 obj_08)
       (pred_8 obj_04)
       (pred_8 obj_14)
       (pred_8 obj_15)
       (pred_2 obj_13)
       (pred_2 obj_20)
       (pred_9 obj_07)
       (pred_9 obj_03)
       (pred_9 obj_17)

       (pred_7 obj_02 obj_10)
       (pred_7 obj_02 obj_18)
       (pred_7 obj_18 obj_16)
       (pred_7 obj_18 obj_12)
       (pred_7 obj_18 obj_02)
       (pred_7 obj_12 obj_05)
       (pred_7 obj_12 obj_19)
       (pred_7 obj_12 obj_18)
       (pred_7 obj_19 obj_06)
       (pred_7 obj_19 obj_12)
       (pred_7 obj_10 obj_11)
       (pred_7 obj_10 obj_16)
       (pred_7 obj_10 obj_02)
       (pred_7 obj_16 obj_01)
       (pred_7 obj_16 obj_05)
       (pred_7 obj_16 obj_18)
       (pred_7 obj_16 obj_10)
       (pred_7 obj_05 obj_21)
       (pred_7 obj_05 obj_06)
       (pred_7 obj_05 obj_12)
       (pred_7 obj_05 obj_16)
       (pred_7 obj_06 obj_09)
       (pred_7 obj_06 obj_19)
       (pred_7 obj_06 obj_05)
       (pred_7 obj_11 obj_08)
       (pred_7 obj_11 obj_01)
       (pred_7 obj_11 obj_10)
       (pred_7 obj_01 obj_04)
       (pred_7 obj_01 obj_21)
       (pred_7 obj_01 obj_16)
       (pred_7 obj_01 obj_11)
       (pred_7 obj_21 obj_14)
       (pred_7 obj_21 obj_09)
       (pred_7 obj_21 obj_05)
       (pred_7 obj_21 obj_01)
       (pred_7 obj_09 obj_15)
       (pred_7 obj_09 obj_06)
       (pred_7 obj_09 obj_21)
       (pred_7 obj_08 obj_04)
       (pred_7 obj_08 obj_11)
       (pred_7 obj_04 obj_14)
       (pred_7 obj_04 obj_01)
       (pred_7 obj_04 obj_08)
       (pred_7 obj_14 obj_15)
       (pred_7 obj_14 obj_21)
       (pred_7 obj_14 obj_04)
       (pred_7 obj_15 obj_09)
       (pred_7 obj_15 obj_14)
       (pred_3 obj_14)
       (pred_3 obj_09)
       (pred_3 obj_21)
       (pred_10  obj_14 obj_13)
       (pred_10  obj_09 obj_20)
       (pred_10  obj_21 obj_13)
       (pred_6 obj_02)
       (pred_6 obj_18)
       (pred_6 obj_12)
       (pred_6 obj_19)
       (pred_6 obj_10)
       (pred_6 obj_16)
       (pred_6 obj_05)
       (pred_6 obj_06)
       (pred_6 obj_11)
       (pred_6 obj_01)
       (pred_6 obj_08)
       (pred_6 obj_04)
       (pred_6 obj_15)

       (pred_1  obj_07 obj_13)
       (pred_1  obj_03 obj_20)
       (pred_1  obj_17 obj_20)
       (pred_12 obj_07 obj_19)
       (pred_12 obj_03 obj_19)
       (pred_12 obj_17 obj_02)
       (pred_11 obj_10)
    )

    (:goal (and
       (pred_12 obj_03 obj_18)
       (pred_12 obj_17 obj_04)
    ))
(:constraints
  (always (not (pred_11 obj_16)))
)
)

; plan
1. (op_2 obj_10 obj_02)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_02)
   goals met: 0 of 2
2. (op_4 obj_02 obj_17)
   deleted: (pred_12 obj_17 obj_02) (pred_4)
   added: (pred_5 obj_17)
   goals met: 0 of 2
3. (op_2 obj_02 obj_18)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_18)
   goals met: 0 of 2
4. (op_2 obj_18 obj_12)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_12)
   goals met: 0 of 2
5. (op_2 obj_12 obj_19)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_19)
   goals met: 0 of 2
6. (op_5 obj_19 obj_03 obj_17)
   deleted: (pred_5 obj_17) (pred_12 obj_03 obj_19)
   added: (pred_5 obj_03) (pred_12 obj_17 obj_19)
   goals met: 0 of 2
7. (op_2 obj_19 obj_12)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_12)
   goals met: 0 of 2
8. (op_2 obj_12 obj_18)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_18)
   goals met: 0 of 2
9. (op_3 obj_18 obj_03)
   deleted: (pred_5 obj_03)
   added: (pred_4) (pred_12 obj_03 obj_18)
   goals met: 1 of 2
10. (op_2 obj_18 obj_12)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_12)
   goals met: 1 of 2
11. (op_2 obj_12 obj_19)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_19)
   goals met: 1 of 2
12. (op_4 obj_19 obj_17)
   deleted: (pred_12 obj_17 obj_19) (pred_4)
   added: (pred_5 obj_17)
   goals met: 1 of 2
13. (op_2 obj_19 obj_12)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_12)
   goals met: 1 of 2
14. (op_2 obj_12 obj_18)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_18)
   goals met: 1 of 2
15. (op_2 obj_18 obj_02)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_02)
   goals met: 1 of 2
16. (op_2 obj_02 obj_10)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_10)
   goals met: 1 of 2
17. (op_2 obj_10 obj_11)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_11)
   goals met: 1 of 2
18. (op_2 obj_11 obj_01)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_01)
   goals met: 1 of 2
19. (op_2 obj_01 obj_04)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_04)
   goals met: 1 of 2
20. (op_3 obj_04 obj_17)
   deleted: (pred_5 obj_17)
   added: (pred_4) (pred_12 obj_17 obj_04)
   goals met: 2 of 2
